ataradov/mcu-starter-projects/samg53/include/component/pmc.h
/* -------- PMC_PCK : (PMC Offset: 0x40) (R/W 32) Programmable Clock 0 Register 0 -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t CSS:3;                     /**< bit:   0..2  Master Clock Source Selection            */
    uint32_t :1;                        /**< bit:      3  Reserved */
    uint32_t PRES:3;                    /**< bit:   4..6  Programmable Clock Prescaler             */
    uint32_t :25;                       /**< bit:  7..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} PMC_PCK_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define PMC_PCK_OFFSET                      (0x40)                                        /**<  (PMC_PCK) Programmable Clock 0 Register 0  Offset */

#define PMC_PCK_CSS_Pos                     0                                              /**< (PMC_PCK) Master Clock Source Selection Position */
#define PMC_PCK_CSS_Msk                     (_U_(0x7) << PMC_PCK_CSS_Pos)                  /**< (PMC_PCK) Master Clock Source Selection Mask */
#define PMC_PCK_CSS(value)                  (PMC_PCK_CSS_Msk & ((value) << PMC_PCK_CSS_Pos))
#define   PMC_PCK_CSS_SLOW_CLK_Val          _U_(0x0)                                       /**< (PMC_PCK) Slow Clock is selected  */
#define   PMC_PCK_CSS_MAIN_CLK_Val          _U_(0x1)                                       /**< (PMC_PCK) Main Clock is selected  */
#define   PMC_PCK_CSS_PLLA_CLK_Val          _U_(0x2)                                       /**< (PMC_PCK) PLLA Clock is selected  */
#define   PMC_PCK_CSS_MCK_Val               _U_(0x4)                                       /**< (PMC_PCK) Master Clock is selected  */
#define PMC_PCK_CSS_SLOW_CLK                (PMC_PCK_CSS_SLOW_CLK_Val << PMC_PCK_CSS_Pos)  /**< (PMC_PCK) Slow Clock is selected Position  */
#define PMC_PCK_CSS_MAIN_CLK                (PMC_PCK_CSS_MAIN_CLK_Val << PMC_PCK_CSS_Pos)  /**< (PMC_PCK) Main Clock is selected Position  */
#define PMC_PCK_CSS_PLLA_CLK                (PMC_PCK_CSS_PLLA_CLK_Val << PMC_PCK_CSS_Pos)  /**< (PMC_PCK) PLLA Clock is selected Position  */
#define PMC_PCK_CSS_MCK                     (PMC_PCK_CSS_MCK_Val << PMC_PCK_CSS_Pos)       /**< (PMC_PCK) Master Clock is selected Position  */
#define PMC_PCK_PRES_Pos                    4                                              /**< (PMC_PCK) Programmable Clock Prescaler Position */
#define PMC_PCK_PRES_Msk                    (_U_(0x7) << PMC_PCK_PRES_Pos)                 /**< (PMC_PCK) Programmable Clock Prescaler Mask */
#define PMC_PCK_PRES(value)                 (PMC_PCK_PRES_Msk & ((value) << PMC_PCK_PRES_Pos))
#define   PMC_PCK_PRES_CLK_1_Val            _U_(0x0)                                       /**< (PMC_PCK) Selected clock  */
#define   PMC_PCK_PRES_CLK_2_Val            _U_(0x1)                                       /**< (PMC_PCK) Selected clock divided by 2  */
#define   PMC_PCK_PRES_CLK_4_Val            _U_(0x2)                                       /**< (PMC_PCK) Selected clock divided by 4  */
#define   PMC_PCK_PRES_CLK_8_Val            _U_(0x3)                                       /**< (PMC_PCK) Selected clock divided by 8  */
#define   PMC_PCK_PRES_CLK_16_Val           _U_(0x4)                                       /**< (PMC_PCK) Selected clock divided by 16  */
#define   PMC_PCK_PRES_CLK_32_Val           _U_(0x5)                                       /**< (PMC_PCK) Selected clock divided by 32  */
#define   PMC_PCK_PRES_CLK_64_Val           _U_(0x6)                                       /**< (PMC_PCK) Selected clock divided by 64  */
#define PMC_PCK_PRES_CLK_1                  (PMC_PCK_PRES_CLK_1_Val << PMC_PCK_PRES_Pos)   /**< (PMC_PCK) Selected clock Position  */
#define PMC_PCK_PRES_CLK_2                  (PMC_PCK_PRES_CLK_2_Val << PMC_PCK_PRES_Pos)   /**< (PMC_PCK) Selected clock divided by 2 Position  */
#define PMC_PCK_PRES_CLK_4                  (PMC_PCK_PRES_CLK_4_Val << PMC_PCK_PRES_Pos)   /**< (PMC_PCK) Selected clock divided by 4 Position  */
#define PMC_PCK_PRES_CLK_8                  (PMC_PCK_PRES_CLK_8_Val << PMC_PCK_PRES_Pos)   /**< (PMC_PCK) Selected clock divided by 8 Position  */
#define PMC_PCK_PRES_CLK_16                 (PMC_PCK_PRES_CLK_16_Val << PMC_PCK_PRES_Pos)  /**< (PMC_PCK) Selected clock divided by 16 Position  */
#define PMC_PCK_PRES_CLK_32                 (PMC_PCK_PRES_CLK_32_Val << PMC_PCK_PRES_Pos)  /**< (PMC_PCK) Selected clock divided by 32 Position  */
#define PMC_PCK_PRES_CLK_64                 (PMC_PCK_PRES_CLK_64_Val << PMC_PCK_PRES_Pos)  /**< (PMC_PCK) Selected clock divided by 64 Position  */
#define PMC_PCK_MASK                        _U_(0x77)                                      /**< \deprecated (PMC_PCK) Register MASK  (Use PMC_PCK_Msk instead)  */
#define PMC_PCK_Msk                         _U_(0x77)                                      /**< (PMC_PCK) Register Mask  */


/* -------- PMC_IER : (PMC Offset: 0x60) (/W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t MOSCXTS:1;                 /**< bit:      0  Main Crystal Oscillator Status Interrupt Enable */
    uint32_t LOCKA:1;                   /**< bit:      1  PLLA Lock Interrupt Enable               */
    uint32_t :1;                        /**< bit:      2  Reserved */
    uint32_t MCKRDY:1;                  /**< bit:      3  Master Clock Ready Interrupt Enable      */
    uint32_t :4;                        /**< bit:   4..7  Reserved */
    uint32_t PCKRDY0:1;                 /**< bit:      8  Programmable Clock Ready 0 Interrupt Enable */
    uint32_t PCKRDY1:1;                 /**< bit:      9  Programmable Clock Ready 1 Interrupt Enable */
    uint32_t PCKRDY2:1;                 /**< bit:     10  Programmable Clock Ready 2 Interrupt Enable */
    uint32_t :5;                        /**< bit: 11..15  Reserved */
    uint32_t MOSCSELS:1;                /**< bit:     16  Main Oscillator Selection Status Interrupt Enable */
    uint32_t MOSCRCS:1;                 /**< bit:     17  Main On-Chip RC Status Interrupt Enable  */
    uint32_t CFDEV:1;                   /**< bit:     18  Clock Failure Detector Event Interrupt Enable */
    uint32_t :13;                       /**< bit: 19..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  struct {
    uint32_t :8;                        /**< bit:   0..7  Reserved */
    uint32_t PCKRDY:3;                  /**< bit:  8..10  Programmable Clock Ready x Interrupt Enable */
    uint32_t :21;                       /**< bit: 11..31 Reserved */
  } vec;                                /**< Structure used for vec  access  */
  uint32_t reg;                         /**< Type used for register access */
} PMC_IER_Type;
